In [1]:
people = {
    'First' : ['Jasim', 'Shanto', 'Abdur', 'Jewel'],
    'Last'  : ['Uddin', 'Rahman', 'Rahim', 'Mahmud'],
    'Email' : ['jasimcse@gmail.com', 'shantocse@gmail.com', 'rahimcse@gmail.com', 'jewelcse@gmail.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    First    Last                Email
0   Jasim   Uddin   jasimcse@gmail.com
1  Shanto  Rahman  shantocse@gmail.com
2   Abdur   Rahim   rahimcse@gmail.com
3   Jewel  Mahmud   jewelcse@gmail.com

In [5]:
df.at[0:3,'last'] = 0

In [6]:
df

    First    Last                Email  last
0   Jasim   Uddin   jasimcse@gmail.com     0
1  Shanto  Rahman  shantocse@gmail.com     0
2   Abdur   Rahim   rahimcse@gmail.com     0
3   Jewel  Mahmud   jewelcse@gmail.com     0

In [7]:
df.at[3,'Last'] = 'Mahmud'

In [8]:
df.drop(columns = ['last'], inplace = True)

In [14]:

df.rename(columns = {'First': 'first_name', 'Last': 'last_name', 'Email':'email'}, inplace = True)

In [15]:
df

  first_name last_name                email
0      Jasim     Uddin   jasimcse@gmail.com
1     Shanto    Rahman  shantocse@gmail.com
2      Abdur     Rahim   rahimcse@gmail.com
3      Jewel    Mahmud   jewelcse@gmail.com

In [16]:
df.loc[0]

first_name                 Jasim
last_name                  Uddin
email         jasimcse@gmail.com
Name: 0, dtype: object

In [17]:
df.loc[0, 'last_name']

'Uddin'

In [19]:
df.loc[1,['first_name', 'email']]

first_name                 Shanto
email         shantocse@gmail.com
Name: 1, dtype: object